art-share-api/app/controllers/artwork_shares_controller.rb

  def create
    artwork_share = ArtworkShare.create!(artwork_share_params)
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 10], ["created_at", "2018-12-05 00:59:53.843553"], ["updated_at", "2018-12-05 00:59:53.843553"]]

  def destroy
    artwork_share.destroy!
---
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 11]]

  def set_artwork_share
    @artwork_share = ArtworkShare.find(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]