art-share-api/app/controllers/artworks_controller.rb

UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "My Mona Lisa"], ["updated_at", "2018-12-04 02:07:16.788667"], ["id", 4]]
---
  def update
    if @artwork.update(artwork_params)

DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]
---
  def destroy
    @artwork.destroy

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_artwork
      @artwork = Artwork.find(params[:id])