art-share-api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "robpike"], ["created_at", "2018-12-03 02:17:08.856168"], ["updated_at", "2018-12-03 02:17:08.856168"]]
---
  def create
    user = User.create!(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 13]]
---
  def destroy
    user.destroy!

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "paulgraham"], ["updated_at", "2018-12-03 23:12:11.253602"], ["id", 8]]
---
  def update
    user.update!(user_params)